# Getting Financial Data - Pandas Datareader

### Introduction:

This time you will get data from a website.


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

In [4]:
from datetime import date

In [13]:
import requests

In [31]:
import csv

### Step 2. Create your time range (start and end variables). The start date should be 01/01/2015 and the end should today (whatever your today is).

In [6]:
timeRange = pd.date_range(start='2015-01-01', end=date.today(), freq='D')

In [8]:
timeRange

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04',
               '2015-01-05', '2015-01-06', '2015-01-07', '2015-01-08',
               '2015-01-09', '2015-01-10',
               ...
               '2022-05-02', '2022-05-03', '2022-05-04', '2022-05-05',
               '2022-05-06', '2022-05-07', '2022-05-08', '2022-05-09',
               '2022-05-10', '2022-05-11'],
              dtype='datetime64[ns]', length=2688, freq='D')

### Step 3. Get an API key for one of the APIs that are supported by Pandas Datareader, preferably for AlphaVantage.

If you do not have an API key for any of the supported APIs, it is easiest to get one for [AlphaVantage](https://www.alphavantage.co/support/#api-key). (Note that the API key is shown directly after the signup. You do *not* receive it via e-mail.)

(For a full list of the APIs that are supported by Pandas Datareader, [see here](https://pydata.github.io/pandas-datareader/readers/index.html). As the APIs are provided by third parties, this list may change.)

### Step 4. Use Pandas Datarader to read the daily time series for the Apple stock (ticker symbol AAPL) between 01/01/2015 and today, assign it to df_apple and print it.

In [10]:
key = 'IDU1MTXIREUYO8OO'

In [38]:
url = 'https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=AAPL&outputsize=full&apikey='+key

In [39]:
url

'https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=AAPL&outputsize=full&apikey=IDU1MTXIREUYO8OO'

In [40]:
r = requests.get(url)
data = r.json()

In [46]:
df_data = pd.DataFrame(data.get('Time Series (Daily)')).T

In [50]:
df_data = df_data[df_data.index>='2015-01-01']

In [51]:
df_data

             1. open   2. high    3. low  4. close  5. volume
2022-05-10  155.5200  156.7400  152.9300  154.5100  115366736
2022-05-09  154.9250  155.8300  151.4900  152.0600  131577921
2022-05-06  156.0100  159.4400  154.1800  157.2800  116124647
2022-05-05  163.8500  164.0800  154.9500  156.7700  130525275
2022-05-04  159.6700  166.4800  159.2600  166.0200  107521649
...              ...       ...       ...       ...        ...
2015-01-08  109.2300  112.1500  108.7000  111.8900   59364547
2015-01-07  107.2000  108.2000  106.6950  107.7500   40105934
2015-01-06  106.5400  107.4300  104.6300  106.2600   65797116
2015-01-05  108.2900  108.6500  105.4100  106.2500   64285491
2015-01-02  111.3900  111.4400  107.3500  109.3300   53204626

[1852 rows x 5 columns]

### Step 5. Add a new column "stock" to the dataframe and add the ticker symbol

In [52]:
df_data['stock']='AAPL'

C:\Users\holacons\AppData\Local\Temp\ipykernel_2136\1115273902.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_data['stock']='AAPL'

In [53]:
df_data

             1. open   2. high    3. low  4. close  5. volume stock
2022-05-10  155.5200  156.7400  152.9300  154.5100  115366736  AAPL
2022-05-09  154.9250  155.8300  151.4900  152.0600  131577921  AAPL
2022-05-06  156.0100  159.4400  154.1800  157.2800  116124647  AAPL
2022-05-05  163.8500  164.0800  154.9500  156.7700  130525275  AAPL
2022-05-04  159.6700  166.4800  159.2600  166.0200  107521649  AAPL
...              ...       ...       ...       ...        ...   ...
2015-01-08  109.2300  112.1500  108.7000  111.8900   59364547  AAPL
2015-01-07  107.2000  108.2000  106.6950  107.7500   40105934  AAPL
2015-01-06  106.5400  107.4300  104.6300  106.2600   65797116  AAPL
2015-01-05  108.2900  108.6500  105.4100  106.2500   64285491  AAPL
2015-01-02  111.3900  111.4400  107.3500  109.3300   53204626  AAPL

[1852 rows x 6 columns]

### Step 6. Repeat the two previous steps for a few other stocks, always creating a new dataframe: Tesla, IBM and Microsoft. (Ticker symbols TSLA, IBM and MSFT.)

In [181]:
key = 'IDU1MTXIREUYO8OO'
df_for = {}
i=0
for symbol in ['TSLA', 'IBM', 'MSFT']:
    url = f'https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol={symbol}&outputsize=full&apikey='+key
    print(url)
    r = requests.get(url)
    data = r.json()
    df_for[i] = pd.DataFrame(data.get('Time Series (Daily)')).T
    df_for[i] = df_for.get(i)[df_for[i].index>='2015-01-01']
    df_for[i]['stock']=symbol
    print(df_for[i])

    i+=1

https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=TSLA&outputsize=full&apikey=IDU1MTXIREUYO8OO
             1. open   2. high    3. low  4. close 5. volume stock
2022-05-10  819.3100  825.3600  774.2500  800.0400  27988983  TSLA
2022-05-09  836.4500  845.6300  781.1500  787.1100  30270074  TSLA
2022-05-06  887.0000  888.0000  843.1050  865.6500  24301037  TSLA
2022-05-05  939.2100  945.6000  857.7000  873.2800  30839731  TSLA
2022-05-04  903.9400  955.5000  885.2800  952.6200  27039655  TSLA
...              ...       ...       ...       ...       ...   ...
2015-01-08  212.8100  213.7999  210.0100  210.6150   3442509  TSLA
2015-01-07  213.3500  214.7800  209.7800  210.9500   2968390  TSLA
2015-01-06  210.0600  214.2000  204.2100  211.2800   6261936  TSLA
2015-01-05  214.5500  216.5000  207.1626  210.0900   5368477  TSLA
2015-01-02  222.8700  223.2500  213.2600  219.3100   4764443  TSLA

[1852 rows x 6 columns]
https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=IBM&outputsize=full&apikey=IDU1MTXIREUYO8OO
             1. open   2. high    3. low  4. close 5. volume stock
2022-05-10  135.0000  135.4100  128.4300  129.1300   8642398   IBM
2022-05-09  134.4100  136.3450  133.3150  134.4400   7647933   IBM
2022-05-06  135.4700  137.9900  135.4700  137.6700   7306396   IBM
2022-05-05  136.4600  137.2600  134.7600  135.9200   5957434   IBM
2022-05-04  132.8700  137.8700  132.1400  137.4000   5913705   IBM
...              ...       ...       ...       ...       ...   ...
2015-01-08  156.2400  159.0440  155.5500  158.4200   4240585   IBM
2015-01-07  157.2000  157.2000  154.0300  155.0500   4701015   IBM
2015-01-06  159.6700  159.9600  155.1700  156.0700   6145670   IBM
2015-01-05  161.2700  161.2700  159.1900  159.5100   4880389   IBM
2015-01-02  161.3100  163.3100  161.0000  162.0600   5525341   IBM

[1852 rows x 6 columns]
https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=MSFT&outputsize=full&apikey=IDU1MTXIREUYO8OO
             1. open   2. high    3. low  4. close 5. volume stock
2022-05-10  271.6900  273.7500  265.0700  269.5000  39336424  MSFT
2022-05-09  270.0600  272.3600  263.3200  264.5800  47725952  MSFT
2022-05-06  274.8050  279.2500  271.2700  274.7300  37780322  MSFT
2022-05-05  285.5400  286.3500  274.3400  277.3500  43260386  MSFT
2022-05-04  282.5900  290.8800  276.7300  289.9800  33463409  MSFT
...              ...       ...       ...       ...       ...   ...
2015-01-08   46.7500   47.7499   46.7200   47.5900  29645202  MSFT
2015-01-07   45.9800   46.4600   45.4900   46.2300  29114061  MSFT
2015-01-06   46.3800   46.7490   45.5400   45.6500  36447854  MSFT
2015-01-05   46.3700   46.7300   46.2500   46.3250  39673865  MSFT
2015-01-02   46.6600   47.4200   46.5400   46.7600  27913852  MSFT

[1852 rows x 6 columns]

### Step 7. Combine the four separate dataFrames into one combined dataFrame df that holds the information for all four stocks

In [182]:
df_full = pd.concat([df_for[0],df_for[1],df_for[2],df_data])

In [189]:
df_full.index.astype('datetime64[ns]')

DatetimeIndex(['2022-05-10', '2022-05-09', '2022-05-06', '2022-05-05',
               '2022-05-04', '2022-05-03', '2022-05-02', '2022-04-29',
               '2022-04-28', '2022-04-27',
               ...
               '2015-01-15', '2015-01-14', '2015-01-13', '2015-01-12',
               '2015-01-09', '2015-01-08', '2015-01-07', '2015-01-06',
               '2015-01-05', '2015-01-02'],
              dtype='datetime64[ns]', length=7408, freq=None)

In [192]:
df_full.index = df_full.index.astype('datetime64[ns]')

In [198]:
df_full.index.name = 'date'

In [199]:
df_full.index

DatetimeIndex(['2022-05-10', '2022-05-09', '2022-05-06', '2022-05-05',
               '2022-05-04', '2022-05-03', '2022-05-02', '2022-04-29',
               '2022-04-28', '2022-04-27',
               ...
               '2015-01-15', '2015-01-14', '2015-01-13', '2015-01-12',
               '2015-01-09', '2015-01-08', '2015-01-07', '2015-01-06',
               '2015-01-05', '2015-01-02'],
              dtype='datetime64[ns]', name='date', length=7408, freq=None)

In [200]:
df_full

             1. open   2. high    3. low  4. close 5. volume stock
date
2022-05-10  819.3100  825.3600  774.2500  800.0400  27988983  TSLA
2022-05-09  836.4500  845.6300  781.1500  787.1100  30270074  TSLA
2022-05-06  887.0000  888.0000  843.1050  865.6500  24301037  TSLA
2022-05-05  939.2100  945.6000  857.7000  873.2800  30839731  TSLA
2022-05-04  903.9400  955.5000  885.2800  952.6200  27039655  TSLA
...              ...       ...       ...       ...       ...   ...
2015-01-08  109.2300  112.1500  108.7000  111.8900  59364547  AAPL
2015-01-07  107.2000  108.2000  106.6950  107.7500  40105934  AAPL
2015-01-06  106.5400  107.4300  104.6300  106.2600  65797116  AAPL
2015-01-05  108.2900  108.6500  105.4100  106.2500  64285491  AAPL
2015-01-02  111.3900  111.4400  107.3500  109.3300  53204626  AAPL

[7408 rows x 6 columns]

### Step 8. Shift the stock column into the index (making it a multi-level index consisting of the ticker symbol and the date).

In [201]:
df_full = df_full.set_index('stock', drop=False, append=True)

In [202]:
df_full

                   1. open   2. high    3. low  4. close 5. volume stock
date       stock
2022-05-10 TSLA   819.3100  825.3600  774.2500  800.0400  27988983  TSLA
2022-05-09 TSLA   836.4500  845.6300  781.1500  787.1100  30270074  TSLA
2022-05-06 TSLA   887.0000  888.0000  843.1050  865.6500  24301037  TSLA
2022-05-05 TSLA   939.2100  945.6000  857.7000  873.2800  30839731  TSLA
2022-05-04 TSLA   903.9400  955.5000  885.2800  952.6200  27039655  TSLA
...                    ...       ...       ...       ...       ...   ...
2015-01-08 AAPL   109.2300  112.1500  108.7000  111.8900  59364547  AAPL
2015-01-07 AAPL   107.2000  108.2000  106.6950  107.7500  40105934  AAPL
2015-01-06 AAPL   106.5400  107.4300  104.6300  106.2600  65797116  AAPL
2015-01-05 AAPL   108.2900  108.6500  105.4100  106.2500  64285491  AAPL
2015-01-02 AAPL   111.3900  111.4400  107.3500  109.3300  53204626  AAPL

[7408 rows x 6 columns]

### Step 7. Create a dataFrame called vol, with the volume values.

In [203]:
df_vol=df_full['5. volume']

In [204]:
df_vol = pd.DataFrame(df_vol)

In [205]:
df_vol

                 5. volume
date       stock
2022-05-10 TSLA   27988983
2022-05-09 TSLA   30270074
2022-05-06 TSLA   24301037
2022-05-05 TSLA   30839731
2022-05-04 TSLA   27039655
...                    ...
2015-01-08 AAPL   59364547
2015-01-07 AAPL   40105934
2015-01-06 AAPL   65797116
2015-01-05 AAPL   64285491
2015-01-02 AAPL   53204626

[7408 rows x 1 columns]

### Step 8. Aggregate the data of volume to weekly.
Hint: Be careful to not sum data from the same week of 2015 and other years.

In [212]:
df_vol.index.get_level_values('date').year

Int64Index([2022, 2022, 2022, 2022, 2022, 2022, 2022, 2022, 2022, 2022,
            ...
            2015, 2015, 2015, 2015, 2015, 2015, 2015, 2015, 2015, 2015],
           dtype='int64', name='date', length=7408)

In [180]:
df_vol.

In [141]:
df_vol.index.get_level_values(0).dtype

dtype('O')

In [248]:
df_vol

                 5. volume
date       stock
2022-05-10 TSLA   27988983
2022-05-09 TSLA   30270074
2022-05-06 TSLA   24301037
2022-05-05 TSLA   30839731
2022-05-04 TSLA   27039655
...                    ...
2015-01-08 AAPL   59364547
2015-01-07 AAPL   40105934
2015-01-06 AAPL   65797116
2015-01-05 AAPL   64285491
2015-01-02 AAPL   53204626

[7408 rows x 1 columns]

In [251]:
df_vol.iloc[:,0] = df_vol.iloc[:,0].astype(int)

In [252]:
df_group_week = df_vol.groupby([df_vol.index.get_level_values('date').year, df_vol.index.get_level_values('date').weekofyear, df_vol.index.get_level_values('stock')]).sum()

C:\Users\holacons\AppData\Local\Temp\ipykernel_2136\3374870119.py:1: FutureWarning: weekofyear and week have been deprecated, please use DatetimeIndex.isocalendar().week instead, which returns a Series. To exactly reproduce the behavior of week and weekofyear and return an Index, you may call pd.Int64Index(idx.isocalendar().week)
  df_group_week = df_vol.groupby([df_vol.index.get_level_values('date').year, df_vol.index.get_level_values('date').weekofyear, df_vol.index.get_level_values('stock')]).sum()

In [ ]:
df_group_week.index.names = ['year', 'week', 'stock']

In [287]:
df_group_week.pivot_table(index=['year','week'],columns='stock')

           5. volume
stock           AAPL       IBM       MSFT       TSLA
year week
2015 1      53204626   5525341   27913852    4764443
     2     282868187  24440360  158596624   22622034
     3     304226647  23272056  157088136   30799137
     4     198737041  31230797  137352632   16215501
     5     465842684  32927307  437786778   15720217
...              ...       ...        ...        ...
2022 15    297460188  15342641  115664768   79625639
     16    376576076  47056765  124741446  113841457
     17    540082324  24560464  211924047  164154275
     18    566193362  27079586  175633827  128677405
     19    246944657  16290331   87062376   58259057

[385 rows x 4 columns]

### Step 9. Find all the volume traded in the year of 2015

In [262]:
df_group_week.index

MultiIndex([(2015,  1, 'AAPL'),
            (2015,  1,  'IBM'),
            (2015,  1, 'MSFT'),
            (2015,  1, 'TSLA'),
            (2015,  2, 'AAPL'),
            (2015,  2,  'IBM'),
            (2015,  2, 'MSFT'),
            (2015,  2, 'TSLA'),
            (2015,  3, 'AAPL'),
            (2015,  3,  'IBM'),
            ...
            (2022, 17, 'MSFT'),
            (2022, 17, 'TSLA'),
            (2022, 18, 'AAPL'),
            (2022, 18,  'IBM'),
            (2022, 18, 'MSFT'),
            (2022, 18, 'TSLA'),
            (2022, 19, 'AAPL'),
            (2022, 19,  'IBM'),
            (2022, 19, 'MSFT'),
            (2022, 19, 'TSLA')],
           names=['year', 'week', 'stock'], length=1540)

In [271]:
df_vol_year = df_group_week.groupby([df_group_week.index.get_level_values('year'), df_group_week.index.get_level_values('stock')]).sum()

In [ ]:
df_vol_year

In [289]:
df_vol_year[df_vol_year.index.get_level_values('year')==2015].pivot_table(index=['year'],columns='stock').style.format(precision=0)